In [2]:
print("hello world")

hello world

##to  markdown press esc and m

I wanted to edit and mark the changes

In [3]:
import pandas as pd

In [4]:
car_sales = pd.read_csv("car-sales.csv")

In [5]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [11]:
car_sales.to_csv("exported_car_sales.csv",index=False)

In [6]:
exported = pd.read_csv("exported_car_sales.csv")

In [7]:
exported.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [14]:
heart_disease = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/heart-disease.csv")

In [15]:
heart_disease

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [16]:
## Describe data

In [17]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [18]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [19]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [20]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [21]:
## descrivbe works on numeric columns only , as price is object we dont see that
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [23]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [29]:
len(car_sales)

10

In [30]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [31]:
## viewing

In [34]:
## returns first 5 rows
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [35]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [43]:
car_sales.loc[4]
## loc refers to the sequence we have assigned like a primary key

Make                Nissan
Colour               White
Odometer (KM)       213095
Doors                    4
Price            $3,500.00
Name: 4, dtype: object

In [42]:
car_sales.iloc[3]

##iloc refers to the actual position starting from 0

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [44]:
car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [45]:
car_sales["Colour"]

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [47]:
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [1]:
pip install lxml

Requirement already satisfied: lxml in c:\users\skrgu\desktop\sample_project_1\env\lib\site-packages (4.9.3)
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install youtube-dl

Collecting youtube-dl
  Downloading youtube_dl-2021.12.17-py2.py3-none-any.whl (1.9 MB)
     ---------------------------------------- 0.0/1.9 MB ? eta -:--:--
     ---------------------------------------- 0.0/1.9 MB ? eta -:--:--
      --------------------------------------- 0.0/1.9 MB 262.6 kB/s eta 0:00:08
     - -------------------------------------- 0.1/1.9 MB 409.6 kB/s eta 0:00:05
     --- ------------------------------------ 0.2/1.9 MB 1.1 MB/s eta 0:00:02
     ---------- ----------------------------- 0.5/1.9 MB 2.3 MB/s eta 0:00:01
     --------------- ------------------------ 0.7/1.9 MB 2.7 MB/s eta 0:00:01
     ---------------------- ----------------- 1.1/1.9 MB 3.4 MB/s eta 0:00:01
     ----------------------- ---------------- 1.1/1.9 MB 3.5 MB/s eta 0:00:01
     ------------------------- -------------- 1.2/1.9 MB 3.2 MB/s eta 0:00:01
     ---------------------------------------  1.9/1.9 MB 4.2 MB/s eta 0:00:01
     ---------------------------------------- 1.9/1.9 MB 4.2 MB/s eta 0:00:00
Installing collected packages: youtube-dl
Successfully installed youtube-dl-2021.12.17
Note: you may need to restart the kernel to use updated packages.

In [3]:
pip install wordcloud

Collecting wordcloud
  Downloading wordcloud-1.9.3-cp310-cp310-win_amd64.whl.metadata (3.5 kB)
Requirement already satisfied: numpy>=1.6.1 in c:\users\skrgu\desktop\sample_project_1\env\lib\site-packages (from wordcloud) (1.26.0)
Requirement already satisfied: pillow in c:\users\skrgu\desktop\sample_project_1\env\lib\site-packages (from wordcloud) (10.0.1)
Requirement already satisfied: matplotlib in c:\users\skrgu\desktop\sample_project_1\env\lib\site-packages (from wordcloud) (3.7.2)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\skrgu\desktop\sample_project_1\env\lib\site-packages (from matplotlib->wordcloud) (1.0.5)
Requirement already satisfied: cycler>=0.10 in c:\users\skrgu\desktop\sample_project_1\env\lib\site-packages (from matplotlib->wordcloud) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\skrgu\desktop\sample_project_1\env\lib\site-packages (from matplotlib->wordcloud) (4.25.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\skrgu\desktop\sample_project_1\env\lib\site-packages (from matplotlib->wordcloud) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\skrgu\desktop\sample_project_1\env\lib\site-packages (from matplotlib->wordcloud) (23.1)
Requirement already satisfied: pyparsing<3.1,>=2.3.1 in c:\users\skrgu\desktop\sample_project_1\env\lib\site-packages (from matplotlib->wordcloud) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\skrgu\desktop\sample_project_1\env\lib\site-packages (from matplotlib->wordcloud) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\skrgu\desktop\sample_project_1\env\lib\site-packages (from python-dateutil>=2.7->matplotlib->wordcloud) (1.16.0)
Downloading wordcloud-1.9.3-cp310-cp310-win_amd64.whl (299 kB)
   ---------------------------------------- 0.0/300.0 kB ? eta -:--:--
   ---------------------------------------- 0.0/300.0 kB ? eta -:--:--
   - -------------------------------------- 10.2/300.0 kB ? eta -:--:--
   --- ----------------------------------- 30.7/300.0 kB 435.7 kB/s eta 0:00:01
   ---------- ---------------------------- 81.9/300.0 kB 651.6 kB/s eta 0:00:01
   ---------------------------------------  297.0/300.0 kB 1.8 MB/s eta 0:00:01
   ---------------------------------------- 300.0/300.0 kB 1.7 MB/s eta 0:00:00
Installing collected packages: wordcloud
Successfully installed wordcloud-1.9.3
Note: you may need to restart the kernel to use updated packages.

In [1]:
from lxml import html
import pafy
import pandas as pd
import os
import numpy as np

In [1]:
pip install pafy

Collecting pafy
  Downloading pafy-0.5.5-py2.py3-none-any.whl (35 kB)
Installing collected packages: pafy
Successfully installed pafy-0.5.5
Note: you may need to restart the kernel to use updated packages.

In [2]:
import os
os.listdir('./')

['.ipynb_checkpoints',
 'car-sales.csv',
 'env',
 'exported_car_sales.csv',
 'images',
 'Introduction to Scikit Learn.ipynb',
 'Learn PAndas-notebook.ipynb',
 'LLM code Practice.ipynb',
 'ML-course',
 'ShraddhaTestScikitLearn.pkl',
 'ztml']

In [ ]:
with open(r'watch-history.html', "r") as file:
    hist_page = file.read()
hist_tree = html.fromstring(hist_page)

In [128]:
from datetime import datetime

date_str = "08Jan2024"
date_obj = datetime.strptime(date_str, '%d%b%Y')
weekday = date_obj.strftime("%A")

print(f"The weekday for {date_str} is {weekday}.")

The weekday for 08Jan2024 is Monday.

In [140]:
youtube_links = pd.read_csv("newYoutubeDoc.csv")

youtube_links['Date'] = youtube_links['DateTime'].str.split(',').str[0]
youtube_links['Date'] = pd.to_datetime(youtube_links['Date'])  
#youtube_links["Weekday"] = date_obj.day()

youtube_links['Time'] = youtube_links['DateTime'].str.split(',').str[1]
#youtube_links['Weekday'] = youtube_links['Date'].dt.day_name()
youtube_links.head()

ValueError: time data "From Google Ads" doesn't match format "%d %b %Y", at position 51. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [132]:
from datetime import datetime

youtube_links['Date'] = youtube_links['DateTime'].str.split(',').str[0]

youtube_links['Time'] = youtube_links['DateTime'].str.split(',').str[1]
youtube_links.head()

date_obj = datetime.strptime(youtube_links['Date'].str, "%d %b %y")
   weekday = date_obj.day()

    # Print the weekday
    print(f"The weekday for {youtube_links['Date']} is {weekday}.")

TypeError: strptime() argument 1 must be str, not StringMethods

The weekday for 08 Jan 2024 is Monday.

In [ ]:
youtube_links['Date'] = youtube_links["DateTime"].str.split(',').str[0]
youtube_links["Time"] = youtube_links["DateTime"].str.split(',').str[1]

youtube_links["Weekday"] = youtube_links['Date'].dt.day_name()
youtube_links.head()